// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ОстаткиДенег.Записывать = Истина;
	Движения.ОборотыДенег.Записывать = Истина;
	
	Для Каждого ТекСтрока из ТабличнаяЧасть Цикл
		
		// регистр ОстаткиДенег
		ДвижениеОстаткиДенег = Движения.ОстаткиДенег.ДобавитьПриход();
		ДвижениеОстаткиДенег.Период = Дата;
		ДвижениеОстаткиДенег.Кошелек = Кошелек;
		ДвижениеОстаткиДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОстаткиДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Доход;
		ДвижениеОстаткиДенег.Сумма = ТекСтрока.Сумма;
		
		// регистр ОборотыДенег
		ДвижениеОборотыДенег = Движения.ОборотыДенег.Добавить();
		ДвижениеОборотыДенег.Период = Дата;
		ДвижениеОборотыДенег.Кошелек = Кошелек;
		ДвижениеОборотыДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОборотыДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Доход;
		ДвижениеОборотыДенег.Сумма = ТекСтрока.Сумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли