// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Блокировка = Новый БлокировкаДанных;

    Остатки = Блокировка.Добавить("РегистрНакопления.ОстаткиДенег");
    Остатки.Режим = РежимБлокировкиДанных.Исключительный;
    Остатки.УстановитьЗначение("Кошелек", КошелекОтправитель);

    Блокировка.Заблокировать();
	
	Движения.ОстаткиДенег.Записывать = Истина;
	Движения.ОстаткиДенег.Очистить();
	Движения.Записать();

	Выборка = ВернутьОстатокНаКошельке();
	
	ОстатокНаКошелькеОтправителе = 0;
	
	Если Выборка.Следующий() Тогда
		ОстатокНаКошелькеОтправителе = Выборка.СуммаОстаток;
	КонецЕсли;
	
	Если Сумма > ОстатокНаКошелькеОтправителе Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон(
			"Сумма перевода %1 превышает баланс кошелька %2", 
			Формат(Сумма, "ЧДЦ=2; ЧН=0,00"),
			Формат(ОстатокНаКошелькеОтправителе, "ЧДЦ=2; ЧН=0,00")
		);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;

	// регистр ОстаткиДенег
	ДвижениеОстаткиДенегРасход = Движения.ОстаткиДенег.ДобавитьРасход();
	ДвижениеОстаткиДенегРасход.Период = Дата;
	ДвижениеОстаткиДенегРасход.Кошелек = КошелекОтправитель;
	ДвижениеОстаткиДенегРасход.Сумма = Сумма;

	// регистр ОстаткиДенег
	ДвижениеОстаткиДенегПриход = Движения.ОстаткиДенег.ДобавитьПриход();
	ДвижениеОстаткиДенегПриход.Период = Дата;
	ДвижениеОстаткиДенегПриход.Кошелек = КошелекПолучатель;
	ДвижениеОстаткиДенегПриход.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вернуть остаток на кошельке.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Вернуть остаток на кошельке:
//		*СуммаОстаток - Число
Функция ВернутьОстатокНаКошельке()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиДенегОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.Остатки(&МоментВремени, Кошелек = &КошелекОтправитель) КАК ОстаткиДенегОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("КошелекОтправитель", КошелекОтправитель);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли