// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РезервыДенег.Записывать = Истина;
	Движения.РезервыДенег.Очистить();
	
	Для Каждого ТекСтрока Из ТабличнаяЧасть Цикл
		
		ДвижениеРезервыДенег = Движения.РезервыДенег.ДобавитьПриход();
		ДвижениеРезервыДенег.Период = Дата;
		ДвижениеРезервыДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеРезервыДенег.Месяц = НачалоМесяца(Месяц);
		ДвижениеРезервыДенег.Сумма = ТекСтрока.Сумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли